<template>
    <div>
      <main>
        <header class="main-header home_header">
          <h1>云上自习室</h1>
        </header>

        <p class="main-header home_p">
          云上自习室是一款面向学生在线协作与自律学习平台。该平台通过模拟传统自习室的环境，在虚拟空间中创建集中学习的氛围。用户可以在云上自习室中选择不同的虚拟自习桌，设定学习目标和时间。平台内置计时工具、任务跟踪、专注度监控和休息提醒等功能，帮助用户高效完成学习任务。此外，平台提供丰富的在线资源库和交流论坛，支持文档共享和实时讨论。云上自习室主要服务于需要高效学习环境的大学生、研究生以及需要远程工作或自主学习的自由职业者。该平台特别适合那些在家中容易分心或在寻找团队学习氛围的用户。通过云上自习室，用户不仅能够改善学习习惯，还能够与不同背景的学习者交流，拓宽知识视野。我们的愿景是打造一个无地域限制的学习社区，让每个寻求知识和进步的个体都能找到属于自己的一席之地。当前市场上类似的竞争产品主要包括远程会议和协作工具，以及专注于个人效率的应用程序。尽管这些工具各有特色，但云上自习室区别于它们的地方在于专注于学习环境的打造和学习者社区的建立。我们的产品不仅提供技术工具，更加注重创建一个正向、互助的学习氛围。通过定期组织在线研讨会和研究小组，云上自习室进一步增强了社区功能，满足了用户在专业成长和个人发展方面的需求。
        </p>
      </main>
    </div>
  </template>
  
  <script setup>
  import { ref } from 'vue';
  
  const qqq = ref('');
  
  const toggleOverlay = () => {
    this.qqq.value = this.qqq.value === 'active' ? '' : 'active';
  };
  </script>
  
  <style>
  .home_p {
    width: 50%;
    margin-left: 25%;
    margin-top: 12%;
  }
  
  .home_header {
    text-align: center;
  }
  

  </style>
  